name: "llm"
platform: "ensemble"
max_batch_size : 8


#input to the model 
input [
    {
        name: "TEXT"
        data_type: TYPE_STRING
        dims: [ -1 ] 
        # -1 means dynamic axis, aka this dimension may change 
    }
]

#output of the model
output [
    {
        name: "OUTPUT"
        data_type: TYPE_STRING
        dims: [ -1 ] 
    }
]

#Type of scheduler to be used
ensemble_scheduling {
    step [
        { #1
            model_name: "tokenizer"
            model_version: -1
            input_map {
            key: "text"
            value: "TEXT"
        }
            output_map [
            {
                key: "input_ids"
                value: "INPUT_IDS"
            }
            ]
        },
        { #2
            model_name: "encoder"
            model_version: -1
            input_map [
            {
                key: "input_ids"
                value: "INPUT_IDS"
            }
        ]
        output_map [
            {
                key: "hidden_states"
                value: "ENCODER_HIDDEN_STATES"
            }
        ]
        },
        { #3
            model_name: "decoder"
            model_version: -1
            input_map [
            {
                key: "input_ids"
                value: "INPUT_IDS"
            },
            {
                key: "encoder_hidden_states"
                value: "ENCODER_HIDDEN_STATES"
            }
        ]
        output_map [
            {
                key: "hidden_states"
                value: "DECODER_HIDDEN_STATES"
            }
        ]
        },
        { #4
            model_name: "tokenizer_out"
            model_version: -1
            input_map [
            {
                key: "decoder_hidden_states"
                value: "DECODER_HIDDEN_STATES"
            }
        ]
        output_map [
            {
                key: "output"
                value: "OUTPUT"
            }
        ]
        }
    ]
}
version_policy{all {} }
